Show / Hide Table of Contents
Enum CheckResultType
Check result type
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum CheckResultType
Fields
 Name |  Description
 Capacity
calculation of capacity by the interaction diagram
 CrackWidth
crack width check
 Deflection
deflection
 Detailing
detailing check
 Fatigue
calculation - response for fatigue
 Interaction
interaction shear+torsion
 Response
calculation plane of deformation
 Shear
shear check
 Stiffness
stiffness
 StressLimitation
stress limitation check
 Torsion
torsion check
 Improve this Doc
 View Source